Revit 2024 API
ContextualHelp Constructor
Constructs a contextual help object.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public ContextualHelp(
	ContextualHelpType helpType,
	string helpPath
)
Visual Basic
Public Sub New ( _
	helpType As ContextualHelpType, _
	helpPath As String _
)
Visual C++
public:
ContextualHelp(
	ContextualHelpType helpType,
	String^ helpPath
)
Parameters
helpType
Type: Autodesk.Revit.UI.ContextualHelpType
The contextual help type.
helpPath
Type: System.String
The contextual help path.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  Thrown when the helpPath is null or empty.
See Also
ContextualHelp Class
Autodesk.Revit.UI Namespace